package search

import "testing"

func TestEngine_Search(t *testing.T) {
	e := NewEngine()
	e.InsertBatch(testDatas)
	ids := e.Search([]rune("love you"))
	t.Logf("ids: %v", ids)
}

var testDatas = []Item{
	{1, "2"},
	{2, "whw"},
	{3, "阿西吧"},
	{4, "悟空"},
	{5, "孙行者"},
	{6, "莫言"},
	{7, "i love you"},
	{8, "american"},
	{9, "如果你突然打了个喷嚏\n\n那一定就是我在想你"},
	{10, "念奴娇·赤壁怀古\n【作者】苏轼 【朝代】宋译文对照\n大江东去，浪淘尽，千古风流人物。\n\n故垒西边，人道是，三国周郎赤壁。\n\n乱石穿空，惊涛拍岸，卷起千堆雪。\n\n江山如画，一时多少豪杰。\n\n遥想公瑾当年，小乔初嫁了，雄姿英发。\n\n羽扇纶巾，谈笑间，樯橹灰飞烟灭。\n\n故国神游，多情应笑我，早生华发。\n\n人生如梦，一尊还酹江月。"},
	{11, "出师表/前出师表\n【作者】诸葛亮 【朝代】三国时期译文对照\n先帝创业未半而中道崩殂，今天下三分，益州疲弊，此诚危急存亡之秋也。然侍卫之臣不懈于内，忠志之士忘身于外者，盖追先帝之殊遇，欲报之于陛下也。诚宜开张圣听，以光先帝遗德，恢弘志士之气，不宜妄自菲薄，引喻失义，以塞忠谏之路也。\n\n宫中府中，俱为一体，陟罚臧否，不宜异同。若有作奸犯科及为忠善者，宜付有司论其刑赏，以昭陛下平明之理，不宜偏私，使内外异法也。\n\n侍中、侍郎郭攸之、费祎、董允等，此皆良实，志虑忠纯，是以先帝简拔以遗陛下。愚以为宫中之事，事无大小，悉以咨之，然后施行，必能裨补阙漏，有所广益。\n\n将军向宠，性行淑均，晓畅军事，试用于昔日，先帝称之曰能，是以众议举宠为督。愚以为营中之事，悉以咨之，必能使行阵和睦，优劣得所。\n\n亲贤臣，远小人，此先汉所以兴隆也；亲小人，远贤臣，此后汉所以倾颓也。先帝在时，每与臣论此事，未尝不叹息痛恨于桓、灵也。侍中、尚书、长史、参军，此悉贞良死节之臣，愿陛下亲之信之，则汉室之隆，可计日而待也。\n\n臣本布衣，躬耕于南阳，苟全性命于乱世，不求闻达于诸侯。先帝不以臣卑鄙，猥自枉屈，三顾臣于草庐之中，咨臣以当世之事，由是感激，遂许先帝以驱驰。后值倾覆，受任于败军之际，奉命于危难之间，尔来二十有一年矣。\n\n先帝知臣谨慎，故临崩寄臣以大事也。受命以来，夙夜忧叹，恐托付不效，以伤先帝之明，故五月渡泸，深入不毛。今南方已定，兵甲已足，当奖率三军，北定中原，庶竭驽钝，攘除奸凶，兴复汉室，还于旧都。此臣所以报先帝而忠陛下之职分也。至于斟酌损益，进尽忠言，则攸之、祎、允之任也。\n\n愿陛下托臣以讨贼兴复之效，不效，则治臣之罪，以告先帝之灵。若无兴德之言，则责攸之、祎、允等之慢，以彰其咎；陛下亦宜自谋，以咨诹善道，察纳雅言，深追先帝遗诏，臣不胜受恩感激。\n\n今当远离，临表涕零，不知所言。"},
}
